# === ЭТАП 1: Сборка бинарника ===
FROM golang:1.26-alpine AS builder

# Устанавливаем рабочую папку внутри контейнера
WORKDIR /build

# Копируем файлы зависимостей и скачиваем их
COPY go.mod go.sum ./
RUN go mod download

# Копируем весь остальной код проекта
COPY . .

# Компилируем приложение в один бинарный файл под названием "app"
# CGO_ENABLED=0 отключает зависимости от системных C-библиотек (сделать бинарник полностью автономным)
# Замени финальную команду сборки на правильный путь к main.go:
RUN CGO_ENABLED=0 GOOS=linux go build -o app ./cmd/app/main.go

# === ЭТАП 2: Финальный легковесный образ ===
FROM alpine:latest

WORKDIR /root/

# Копируем скомпилированный бинарник из предыдущего этапа (builder)
COPY --from=builder /build/app .

# Открываем порт 8080 наружу
EXPOSE 8080

# Команда для запуска приложения при старте контейнера
CMD ["./app"]